#include <iostream>

/*
    Написать алгоритм Дейкстры. 

    Бинарное дерево задается в файле в виде матрицы. 
    Входные данные: начальная и конечная вершина.
    После завершения обхода графа результат должен быть записан в файл путем добавления строки в формате:
        начальная вершина,
        конечная вершина,
        промежуточные вершины от начальной до конечной. 
    Исходный граф должен содержать не менее 10-ти вершин и 30-ти связей между ними.
*/

int main() {
    std::cout << "Hello World!";
    return 0;
}